MRNIU/ArduinoCore-freertos/boards.txt
# See: https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5-3rd-party-Hardware-specification

menu.pnum=Board part number

menu.xserial=U(S)ART support
menu.usb=USB support (if available)
menu.xusb=USB speed (if available)
menu.virtio=Virtual serial support

menu.opt=Optimize
menu.rtlib=C Runtime Library
menu.upload_method=Upload method

################################################################################
# Generic H7
GenH7.name=Generic STM32H7 Series

GenH7.build.core=arduino
GenH7.build.board=GenH7
GenH7.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenH7.build.cmsis_lib_gcc=arm_cortexM7lfsp_math
GenH7.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
GenH7.build.series=STM32H7xx
GenH7.build.mcu=cortex-m7

# Daisy Seed board
GenH7.menu.pnum.DAISY_SEED=Daisy Seed
GenH7.menu.pnum.DAISY_SEED.upload.maximum_size=131072
GenH7.menu.pnum.DAISY_SEED.upload.maximum_data_size=524288
GenH7.menu.pnum.DAISY_SEED.build.board=DAISY_SEED
GenH7.menu.pnum.DAISY_SEED.build.product_line=STM32H750xx
GenH7.menu.pnum.DAISY_SEED.build.variant=DAISY_SEED

# Portenta H7 M4 Core
GenH7.menu.pnum.PORTENTA_H7_M4=Arduino Portenta H7 (M4 core)
GenH7.menu.pnum.PORTENTA_H7_M4.mcu=cortex-m4
GenH7.menu.pnum.PORTENTA_H7_M4.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=softfp
GenH7.menu.pnum.PORTENTA_H7_M4.build.board=PORTENTA_H7_M4
GenH7.menu.pnum.PORTENTA_H7_M4.build.product_line=STM32H747xx
GenH7.menu.pnum.PORTENTA_H7_M4.build.variant=PORTENTA_H7_M4

GenH7.menu.pnum.PORTENTA_H7_M4.compiler.mbed.extra_defines="@{build.variant.path}/defines.txt"
GenH7.menu.pnum.PORTENTA_H7_M4.compiler.mbed.c.elf.extra_flags="@{build.variant.path}/ldflags.txt"
GenH7.menu.pnum.PORTENTA_H7_M4.compiler.mbed.c.extra_flags="@{build.variant.path}/cflags.txt"
GenH7.menu.pnum.PORTENTA_H7_M4.compiler.mbed.cpp.extra_flags="@{build.variant.path}/cxxflags.txt"

GenH7.menu.pnum.PORTENTA_H7_M4.vid.0=0x2341
GenH7.menu.pnum.PORTENTA_H7_M4.pid.0=0x005b
GenH7.menu.pnum.PORTENTA_H7_M4.build.vid=0x2341
GenH7.menu.pnum.PORTENTA_H7_M4.build.pid=0x005b

GenH7.menu.pnum.PORTENTA_H7_M4.upload.tool=dfu-util
GenH7.menu.pnum.PORTENTA_H7_M4.upload.vid=0x2341
GenH7.menu.pnum.PORTENTA_H7_M4.upload.pid=0x035b
GenH7.menu.pnum.PORTENTA_H7_M4.upload.protocol=
GenH7.menu.pnum.PORTENTA_H7_M4.upload.address=0x08100000
GenH7.menu.pnum.PORTENTA_H7_M4.upload.interface=0
GenH7.menu.pnum.PORTENTA_H7_M4.upload.use_1200bps_touch=true
GenH7.menu.pnum.PORTENTA_H7_M4.upload.wait_for_upload_port=true
GenH7.menu.pnum.PORTENTA_H7_M4.upload.native_usb=true
GenH7.menu.pnum.PORTENTA_H7_M4.upload.maximum_size=1048576
GenH7.menu.pnum.PORTENTA_H7_M4.upload.maximum_data_size=294248

# Portenta H7 M7 Core
GenH7.menu.pnum.PORTENTA_H7_M7=Arduino Portenta H7 (M7 core)
GenH7.menu.pnum.PORTENTA_H7_M7.build.flags.fp=-mfpu=fpv5-d16 -mfloat-abi=softfp
GenH7.menu.pnum.PORTENTA_H7_M7.build.board=PORTENTA_H7_M7
GenH7.menu.pnum.PORTENTA_H7_M7.build.product_line=STM32H747xx
GenH7.menu.pnum.PORTENTA_H7_M7.build.variant=PORTENTA_H7_M7

GenH7.menu.pnum.PORTENTA_H7_M7.compiler.mbed.extra_defines="@{build.variant.path}/defines.txt"
GenH7.menu.pnum.PORTENTA_H7_M7.compiler.mbed.c.elf.extra_flags="@{build.variant.path}/ldflags.txt"
GenH7.menu.pnum.PORTENTA_H7_M7.compiler.mbed.c.extra_flags="@{build.variant.path}/cflags.txt"
GenH7.menu.pnum.PORTENTA_H7_M7.compiler.mbed.cpp.extra_flags="@{build.variant.path}/cxxflags.txt"

GenH7.menu.pnum.PORTENTA_H7_M7.vid.0=0x2341
GenH7.menu.pnum.PORTENTA_H7_M7.pid.0=0x025b
GenH7.menu.pnum.PORTENTA_H7_M7.vid.1=0x2341
GenH7.menu.pnum.PORTENTA_H7_M7.pid.1=0x035b
GenH7.menu.pnum.PORTENTA_H7_M7.vid.2=0x2341
GenH7.menu.pnum.PORTENTA_H7_M7.pid.2=0x045b

GenH7.menu.pnum.PORTENTA_H7_M7.upload.tool=dfu-util
GenH7.menu.pnum.PORTENTA_H7_M7.upload.vid=0x2341
GenH7.menu.pnum.PORTENTA_H7_M7.upload.pid=0x035b
GenH7.menu.pnum.PORTENTA_H7_M7.upload.protocol=
GenH7.menu.pnum.PORTENTA_H7_M7.upload.address=0x08040000
GenH7.menu.pnum.PORTENTA_H7_M7.upload.interface=0
GenH7.menu.pnum.PORTENTA_H7_M7.upload.use_1200bps_touch=true
GenH7.menu.pnum.PORTENTA_H7_M7.upload.wait_for_upload_port=true
GenH7.menu.pnum.PORTENTA_H7_M7.upload.native_usb=true
GenH7.menu.pnum.PORTENTA_H7_M7.upload.maximum_size=786432
GenH7.menu.pnum.PORTENTA_H7_M7.upload.maximum_data_size=523624

# Upload menu
GenH7.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenH7.menu.upload_method.swdMethod.upload.protocol=0
GenH7.menu.upload_method.swdMethod.upload.options=-g
GenH7.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenH7.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenH7.menu.upload_method.serialMethod.upload.protocol=1
GenH7.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenH7.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenH7.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenH7.menu.upload_method.dfuMethod.upload.protocol=2
GenH7.menu.upload_method.dfuMethod.upload.options=-g
GenH7.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenH7.menu.upload_method.dfu-util=dfu-util
GenH7.menu.upload_method.dfu-util.upload.protocol=
GenH7.menu.upload_method.dfu-util.upload.options=-g
GenH7.menu.upload_method.dfu-util.upload.tool=dfu-util

GenH7.menu.usb.none=None
GenH7.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
GenH7.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
GenH7.menu.usb.CDC=CDC (no generic 'Serial')
GenH7.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
GenH7.menu.usb.HID=HID (keyboard and mouse)
GenH7.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
GenH7.menu.xusb.FS=Low/Full Speed
GenH7.menu.xusb.HSFS=High Speed in Full Speed mode
GenH7.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

GenH7.menu.opt.osstd=Smallest (-Os default)
GenH7.menu.opt.oslto=Smallest (-Os) with LTO
GenH7.menu.opt.oslto.build.flags.optimize=-Os -flto
GenH7.menu.opt.o1std=Fast (-O1)
GenH7.menu.opt.o1std.build.flags.optimize=-O1
GenH7.menu.opt.o1lto=Fast (-O1) with LTO
GenH7.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenH7.menu.opt.o2std=Faster (-O2)
GenH7.menu.opt.o2std.build.flags.optimize=-O2
GenH7.menu.opt.o2lto=Faster (-O2) with LTO
GenH7.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenH7.menu.opt.o3std=Fastest (-O3)
GenH7.menu.opt.o3std.build.flags.optimize=-O3
GenH7.menu.opt.o3lto=Fastest (-O3) with LTO
GenH7.menu.opt.o3lto.build.flags.optimize=-O3 -flto
GenH7.menu.opt.ogstd=Debug (-g)
GenH7.menu.opt.ogstd.build.flags.optimize=-g -Og

GenH7.menu.rtlib.nano=Newlib Nano (default)
GenH7.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenH7.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenH7.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenH7.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenH7.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenH7.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenH7.menu.rtlib.full=Newlib Standard
GenH7.menu.rtlib.full.build.flags.ldspecs=
